app/controllers/ticket_controller.rb

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "tickets" ("vehicle_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["vehicle_id", 1], ["user_id", 1], ["created_at", "2015-10-25 18:43:40.635901"], ["updated_at", "2015-10-25 18:43:40.635901"]]
---
  def create
    vehicle_id = params[:vehicle_id]
    vehicle = Vehicle.find vehicle_id
    ticket = Ticket.create(vehicle_id: vehicle_id, user_id:vehicle.user_id)