app/controllers/user_controller.rb

  def create

    user = User.create(name: SecureRandom.hex, identifier: SecureRandom.hex )
    vehicle = Vehicle.create(vehicle_type: "car", identifier: SecureRandom.hex, user_id: user.id)
---
INSERT INTO "users" ("name", "identifier", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "c533b1168883fb00650bdda48ab56fc6"], ["identifier", "c33c2ad11a77d433dcea51f78afd2dd5"], ["created_at", "2015-10-25 18:38:49.388245"], ["updated_at", "2015-10-25 18:38:49.388245"]]
INSERT INTO "vehicles" ("vehicle_type", "identifier", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["vehicle_type", "car"], ["identifier", "3ebbd041e07018846140dde2de5f27da"], ["user_id", 3], ["created_at", "2015-10-25 18:48:17.359550"], ["updated_at", "2015-10-25 18:48:17.359550"]]